### Report for environment: test

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (1 to add, 2 to change, 1 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_alb.alb-internal will be updated in-place
  ~ resource "aws_alb" "alb-internal" {
        id                                                           = "arn:aws:elasticloadbalancing:eu-west-2:005235525306:loadbalancer/app/test-gp2gp-messenger-alb-int/5198e965bc888714"
        name                                                         = "test-gp2gp-messenger-alb-int"
        tags                                                         = {
            "CreatedBy"   = "prm-deductions-gp2gp-messenger"
            "Environment" = "test"
        }
        # (27 unchanged attributes hidden)

      ~ access_logs {
          ~ bucket  = (sensitive value)
          - prefix  = "gp2gp-messenger" -> null
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_service.ecs-service will be updated in-place
  ~ resource "aws_ecs_service" "ecs-service" {
        id                                 = "arn:aws:ecs:eu-west-2:005235525306:service/test-gp2gp-messenger-ecs-cluster/test-gp2gp-messenger-service"
        name                               = "test-gp2gp-messenger-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-2:005235525306:task-definition/gp2gp-messenger:135" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:eu-west-2:005235525306:task-definition/gp2gp-messenger:135" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-2:005235525306:task-definition/gp2gp-messenger" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "gp2gp-messenger" -> (known after apply)
      ~ revision                 = 135 -> (known after apply)
        tags                     = {
            "CreatedBy"   = "prm-deductions-gp2gp-messenger"
            "Environment" = "test"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

```

</details>